tap "homebrew/services"

# Unix
brew "git"
brew "openssl"
brew "vim"
brew "zsh"

# Programming languages
brew "node"
brew "go"
cask "java"

# Databases
brew "postgres", restart_service: true
brew "redis", restart_service: true
brew "mysql"
# brew "mongodb"

# Applications
cask "vlc"                 unless Dir.exists?('/Applications/VLC.app')
cask "atom"                unless Dir.exists?('/Applications/atom.app')
cask "sublime-text"        unless Dir.exists?('/Applications/Sublime Text.app')
cask "visual-studio-code"  unless Dir.exists?('/Applications/Visual Studio Code.app')
cask "android-studio"      unless Dir.exists?('/Applications/Android Studio.app')
cask "iterm2"              unless Dir.exists?('/Applications/iTerm.app')
cask "google-chrome"       unless Dir.exists?('/Applications/Google Chrome.app')
cask "firefox"             unless Dir.exists?('/Applications/Firefox.app')
cask "slack"               unless Dir.exists?('/Applications/Slack.app')
cask "github-desktop"      unless Dir.exists?('/Applications/Github Desktop.app')
cask "postico"             unless Dir.exists?('/Applications/Postico.app')
cask "mysqlworkbench"      unless Dir.exists?('/Applications/MySqlWorkbench.app')
cask "notion"              unless Dir.exists?('/Applications/Notion.app')
cask "evernote"            unless Dir.exists?('/Applications/Evernote.app')
cask "spotify"             unless Dir.exists?('/Applications/Spotify.app')
cask "1password"           unless Dir.exists?('/Applications/1Password.app')
cask "rescuetime"          unless Dir.exists?('/Applications/RescueTime.app')
cask "dropbox"             unless Dir.exists?('/Applications/Dropbox.app')
cask "google-drive"        unless Dir.exists?('/Applications/Google Drive.app')
cask "zoomus"              unless Dir.exists?('/Applications/zoom.us.app')
